package arr.sort.p5n;
/*
5. Сортировка вставками. Дана последовательность чисел . Требуется переставить числа в порядке
возрастания. Делается это следующим образом. Пусть - упорядоченная последовательность, т. е.
a1  a2  an
. Берется следующее число
ai+1
и вставляется в последовательность так, чтобы новая
последовательность была тоже возрастающей. Процесс производится до тех пор, пока все элементы от i +1 до n
не будут перебраны. Примечание. Место помещения очередного элемента в отсортированную часть производить
с помощью двоичного поиска. Двоичный поиск оформить в виде отдельной функции.
 */
public class Main {
    public static void main(String[] args) {

    }
}
