package module1.cycles;

import java.util.Scanner;

//Напишите программу, где пользователь вводит любое целое положительное число. А программа
//суммирует все числа от 1 до введенного пользователем числа.
public class Task1 {
	public static void main (String[] arg) {
		Scanner scanner = new Scanner(System.in);
		System.out.println("Введите целое положительное число");
		int x = scanner.nextInt();
		scanner.close();
		
		int sum = 0;
		for (int i =1; i <= x; i++) {
			sum += i;
		}
		System.out.println("Результат " + sum);
	}
}
